# collections模块
# 有序字典 orderddict
# 默认字典 defaultdict
# 可命名元祖 namedtuple

# 时间模块
# 三种时间格式  时间戳时间 结构化时间 格式化时间
# 计算时间差
    # 两个时间都转换成时间戳
    # 时间戳之间相减 以秒为单位的小数差
    # 将小数差转换成结构化时间 元组 1970 1.3
    # 用当前结构化的时间差 减去 1970 1 1 0：0:0

# random模块
    # 发红包 发200的红包，发5个 —— 代码
        # (0，200) 取4个点
    # 验证码
        # 从数字中选一个 0-9
        # 从a-z选一个
        # 到底是字母还是数字也是随机的

# os模块 —— 操作系统打交道
    # 文件相关
    # 文件夹相关的
    # 和执行系统命令相关
    # 和路径相关的

# sys模块 —— 和解释器相关的
    # sys.path
    # sys.argv 执行py脚本的时候传入的参数

# 正则模块
    # 正则表达式
        # 能够判断 邮箱 手机号
    # re模块


# 三个模块+序列化
