'''
购物车
功能要求：
要求用户输入总资产，例如：2000
显示商品列表，让用户根据序号选择商品，加入购物车
购买，如果商品总额大于总资产，提示账户余额不足，否则，购买成功。
goods = [{"name": "电脑", "price": 1999},
           {"name": "鼠标", "price": 10},
　　　　　　{"name": "游艇", "price": 20},
　　　　　　{"name": "美女", "price": 998},
]
'''

goods = [{"name": "电脑", "price": 1999},
           {"name": "鼠标", "price": 10},
         {"name": "游艇", "price": 20},
         {"name": "美女", "price": 998},]
'''
money = input()
shopping_car = [{name:；电脑，count：3}]
1,展示商品
    1， 电脑 1999
    2， 鼠标 10
    .....
    1,输入的是全部数字
    2，判断，范围。
    购买成功，打印购买的商品列表

'''