#!/usr/bin/env python3
# 1，有如下变量（tu是个元祖），请实现要求的功能
#     tu = ("alex", [11, 22, {"k1": 'v1', "k2": ["age", "name"], "k3": (11,22,33)}, 44])
#     a. 讲述元祖的特性
# 元组不可变，只读
#     b. 请问tu变量中的第一个元素 “alex” 是否可被修改？
# 不能
#     c. 请问tu变量中的"k2"对应的值是什么类型？是否可以被修改？如果可以，请在其中添加一个元素 “Seven”
# 列表
# tu = ("alex", [11, 22, {"k1": 'v1', "k2": ["age", "name"], "k3": (11, 22, 33)}, 44])
# tu[1][2]["k2"].append("Seven")
# print(tu)
# d. 请问tu变量中的"k3"对应的值是什么类型？是否可以被修改？如果可以，请在其中添加一个元素 “Seven”
# 元组，不可修改

# 2， 字典dic,dic = {'k1': "v1", "k2": "v2", "k3": [11,22,33]}
# dic = {'k1': "v1", "k2": "v2", "k3": [11,22,33]}

# #     a. 请循环输出所有的key
# for i in dic.keys():
#     print(i)
# #     b. 请循环输出所有的value
# for i in dic.values():
#     print(i)
#     c. 请循环输出所有的key和value
# for k,v in dic.items():
#     print(k,v)
#     d. 请在字典中添加一个键值对，"k4": "v4"，输出添加后的字典
# dic["k4"] = "v4"
# print(dic)
# #     e. 请在修改字典中 “k1” 对应的值为 “alex”，输出修改后的字典
# dic["k1"] = "alex"
# print(dic)
# #     f. 请在k3对应的值中追加一个元素 44，输出修改后的字典
# dic["k3"].append(44)
# print(dic)
# #     g. 请在k3对应的值的第 1 个位置插入个元素 18，输出修改后的字典
# dic["k3"].insert(1,18)
# print(dic)
# 3，
# av_catalog = {
#     "欧美":{
#         "www.youporn.com": ["很多免费的,世界最大的","质量一般"],
#         "www.pornhub.com": ["很多免费的,也很大","质量比yourporn高点"],
#         "letmedothistoyou.com": ["多是自拍,高质量图片很多","资源不多,更新慢"],
#         "x-art.com":["质量很高,真的很高","全部收费,屌丝请绕过"]
#     },
#     "日韩":{
#         "tokyo-hot":["质量怎样不清楚,个人已经不喜欢日韩范了","verygood"]
#     },
#     "大陆":{
#         "1024":["全部免费,真好,好人一生平安","服务器在国外,慢"]
#     }
# }
#
# # 	# 1，给此 ["很多免费的,世界最大的","质量一般"]列表第二个位置插入一个元素：'量很大'。
# av_catalog["欧美"]["www.youporn.com"].append("量很大")
# # 	# 2，将此 ["质量很高,真的很高","全部收费,屌丝请绕过"]列表的 "全部收费,屌丝请绕过" 删除。
# av_catalog["欧美"]["x-art.com"].remove("全部收费,屌丝请绕过")
# print(av_catalog)
# # 	# 3，将此 ["质量很高,真的很高","全部收费,屌丝请绕过"]列表的 "全部收费,屌丝请绕过" 删除。
# # 	# 4，将此["质量怎样不清楚,个人已经不喜欢日韩范了","verygood"]列表的 "verygood"全部变成大写。
# av_catalog["日韩"]["tokyo-hot"][1] = av_catalog["日韩"]["tokyo-hot"][1].upper()
# print(av_catalog)
# # 	# 5，给 '大陆' 对应的字典添加一个键值对 '1048' :['一天就封了']
# av_catalog["大陆"]["1048"] = ['一天就封了']
# print(av_catalog)
# # 	# 6，删除此"letmedothistoyou.com": ["多是自拍,高质量图片很多","资源不多,更新慢"]键值对。
# av_catalog["欧美"].pop("letmedothistoyou.com")
# print(av_catalog)
# # 	# 7，给此["全部免费,真好,好人一生平安","服务器在国外,慢"]列表的第一个元素，加上一句话：'可以爬下来'
# av_catalog["大陆"]["1024"].append("可以爬下来")
# print(av_catalog)
#
#
# 4、有字符串"k:1|k1:2|k2:3|k3:4" 处理成字典 {'k':1,'k1':2....}
# s = "k:1|k1:2|k2:3|k3:4"
# li = s.split("|")
# dic = {}
# for i in li:
#     j = i.split(":")
#     dic[j[0]] = j[1]
# print(dic)

#
# 5、元素分类
#     有如下值li= [11,22,33,44,55,66,77,88,99,90]，将所有大于 66 的值保存至字典的第一个key中，将小于 66 的值保存至第二个key的值中。
# 即： {'k1': 大于66的所有值列表, 'k2': 小于66的所有值列表}
# li = [11,22,33,44,55,66,77,88,99,90]
# dic = {'k1': [], 'k2': []}
# for i in li:
#     if i > 66:
#         dic["k1"].append(i)
#     else:
#         dic["k2"].append(i)
# print(dic)


# 6、输出商品列表，用户输入序号，显示用户选中的商品
#     商品 li = ["手机", "电脑", '鼠标垫', '游艇']
li = ["手机", "电脑", '鼠标垫', '游艇']
# 要求：1：页面显示 序号 + 商品名称，如：
#       	1 手机
# 	   	2 电脑
#      		 …
#      2： 用户输入选择的商品序号，然后打印商品名称
#      3：如果用户输入的商品序号有误，则提示输入有误，并重新输入。
#      4：用户输入Q或者q，退出程序。
# 明日默写内容。
# 1)字典的增删改查。
# 2)过滤敏感字符代码的默写。
# li = ["苍老师","东京热","武藤兰","波多野结衣"]
# l1 = []
# comment = input('请输入评论>>>')
# for i in li:
#     if i in comment:
#         comment = comment.replace(i,'*'*len(i))
# l1.append(comment)
# print(l1)
